resources/testData.json

{
    "payments": {
        "insertTestPayment": {
            "title": "test payment",
            "description": "test description",
            "amount": "20",
            "initialPaymentAmount": "23",
            "currency": "PMA",
            "numberOfPayments": 5,
            "frequency": 3,
            "typeID": 1,
            "networkID": 3
        },
        "updateTestPayment": {
            "id": "",
            "title": "changes title",
            "description": "another description",
            "promo": "testing",
            "amount": "20",
            "initialPaymentAmount": "23",
            "currency": "CVC",
            "numberOfPayments": 5,
            "typeID": 2,
            "frequency": 3,
            "userID": "string",
            "networkID": 3
        },
        "updateTestPaymentContract": {
            "id": "",
            "title": "changes title",
            "description": "another description",
            "promo": "testing",
            "status": 2,
            "customerAddress": "0xuiuin2n",
            "amount": "20",
            "initialPaymentAmount": "23",
            "currency": "CVC",
            "startTimestamp": "987654321",
            "endTimestamp": "123456789",
            "numberOfPayments": 5,
            "nextPaymentDate": "123456789",
            "lastPaymentDate": "123456789",
            "type": 2,
            "frequency": 3,
            "registerTxHash": "string",
            "registerTxStatus": 1,
            "executeTxHash": "string",
            "executeTxStatus": 1,
            "cancelTxHash": "string",
            "cancelTxStatus": 1,
            "initialPaymentTxHash": "string",
            "initialPaymentTxStatus": 1,
            "merchantAddress": "string",
            "pullPaymentAddress": "string",
            "userID": "string",
            "networkID": 3
        }
    }
}